# ax2 + bx + c = 0
# D = b2 - 4ac
# 

#Создаем дефолтные значения на случай пустого ввода (можно же не указывать множитель)
a1 = 0
b1 = 0
c1 = 0

a1 = input("введите коэффициент А: ")
if a1 != 0:
    b1 = input("введите коэффициент B: ")
    if b1 != 0:
        c1 = input("введите коэффициент C: ")
        if c1 != 0:
            print(a1, b1, c1)
            a = int(a1)
            b = int(b1)
            c = int(c1)
            D = b * b - 4 * a * c 
            print("D=", D)
            if D > 0:
                print("D больше 0, будет 2 корня")
                n = 2
                D1 = D ** (1./n) 
                print("D1=", D1)
                x1 = ((b*(-1)) + D1) / 2 * a
                print("x1=",x1)
                x2 = ((b*(-1)) - D1) / 2 * b
                print("x2=",x2)
            if D == 0:
                print("D равен 0, будет 1 корень")
                n = 2
                D1 = D ** (1./n) 
                print("D1=", D1)
                x1 = ((b*(-1)) + D1) / 2 * a
                print("x=",x1)
            if D < 0:
                print("D меньше 0, действительных корней нет, находим комплексные числа")
                x1 = (-b + D ** 0.5) / (2 * a)
                x2 = (-b - D ** 0.5) / (2 * a)
                print('x₁ = ' + str(x1))
                print('x₂ = ' + str(x2))
